samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
/**
 * @file sik_radio_test.cpp
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief SiK radio driver test 
 * 
 * @details Setup 
 *          - Hardware 
 *            * STM32F4 microcontroller with a serial connection to a PC 
 *            * Two SiK telemetry radios (or RFD900): 
 *              1. One connected to the STM32F4 
 *              2. Another connected to a PC running Mission Planner 
 *          - Software 
 *            * Mission Planner on a PC with an established USB connection to one of the 
 *              telemetry radios and using the MAVLINK protocol. 
 *            * Serial monitor on a PC to allow the exchange of info with the STM32F4. 
 *          - Notes 
 *            * A single PC connected to the STM32F4 and running Mission Planner can be 
 *              used or it can be two separate computers. 
 *            * Certain communication (AT/RT) settings must match between both telemetry 
 *              radios in order for them to work together. See the SiK radio documentation 
 *              for more details. 
 *            * A connection between both radios must be established before any 
 *              meaningful work can be done by this code. 
 *          
 *          Configuration 
 *          - UART 
 *            * Two UART ports must be configured, one for the serial terminal connection 
 *              and another for the SiK radio. 
 *          - DMA 
 *            * Since data can be sent to the STM32F4 via UART from either the serial 
 *              terminal or the SiK radio without the STM32F4 requesting it, DMA is 
 *              configured for both UART ports so the data automatically gets stored 
 *              in a buffer. This prevents and loss of data. 
 *          - Interrupts 
 *            * Interrupts are configured for both UART ports for when an RX line is 
 *              detected to have gone idle. This indicates that there was data being 
 *              received and that the data is now done being received. The test code 
 *              won't perform any actions unless and interrupt occurs. 
 *          
 *          Dependencies 
 *          - STM32F4 driver library 
 *            - This library provides an easy interface to the SiK radio device driver 
 *              as well as UART, DMA and interrupt drivers. 
 *          - MAVLINK V2 C library 
 *            - The SiK radios and Mission Planner are designed to work with the MAVLINK 
 *              protocol. This code uses the library to decode and encode MAVLINK 
 *              messages. 
 *            - There are pre-built C and Python libraries but specific library versions 
 *              can be built manually. The pre-built C library works for this 
 *              application. 
 *          
 *          Procedure 
 *          - This code looks for data received from both the SiK telemetry radio and 
 *            the serial terminal. If data is received by the radio then the code will 
 *            attempt to decode a pre-defined MAVLINK message. A valid message will be 
 *            sent to the serial terminal for the user to see. If data is received from 
 *            the serial terminal then the code will process the input and perform the 
 *            needed action which can be to either encode and send a MAVLINK message or 
 *            put the SiK radio into AT command mode. 
 * 
 * @version 0.1
 * @date 2024-12-11
 * 
 * @copyright Copyright (c) 2024
 * 
 */

//=======================================================================================
// Includes 

#include "sik_radio_test.h" 
#include "stm32f4xx_it.h" 

extern "C"
{
    // For C headers without C++ guards 
    #include "common/mavlink.h" 
}

//=======================================================================================


//=======================================================================================
// Macros 

#define SIK_TEST_MSG_BUFF_SIZE 200 
#define SIK_TEST_SYS_ID 1            // GCS IDs start at 255, systems start at 1 
#define SIK_TEST_HB_TIMEOUT 10 
#define SIK_TEST_AT_TIMEOUT 5 

//=======================================================================================


//=======================================================================================
// Global data 

// User & device data 
typedef struct sik_serial_data_s 
{
    USART_TypeDef *uart; 
    DMA_Stream_TypeDef *dma_stream; 
    uint8_t cb[SIK_TEST_MSG_BUFF_SIZE];              // Circular buffer populated by DMA 
    cb_index_t cb_index;                             // Circular buffer indexing info 
    dma_index_t dma_index;                           // DMA transfer indexing info 
    uint8_t data_in_buff[SIK_TEST_MSG_BUFF_SIZE];    // Buffer that stores latest UART input 
    uint8_t data_out_buff[SIK_TEST_MSG_BUFF_SIZE];   // Buffer that stores outgoing data 
    uint16_t data_in_index;                          // Data input buffer index 
}
sik_serial_data_t; 

static sik_serial_data_t radio_data; 
static sik_serial_data_t user_data; 


// System MAVLink data 
typedef struct sik_system_data_s 
{
    // MAVLink identification 
    int channel; 
    uint8_t system_id; 
    uint8_t component_id; 

    // MAVLink packet handling 
    mavlink_message_t msg; 
    mavlink_status_t status; 

    // Messages 
    mavlink_heartbeat_t heartbeat; 
    mavlink_global_position_int_t global_position; 

    // Timers 
    uint8_t heartbeat_timer; 
    uint8_t at_mode_timer; 

    // Status 
    uint8_t at_mode           : 1;   // AT command mode flag 
    uint8_t at_mode_requested : 1;   // AT command mode requested flag 
    uint8_t ui_mode           : 1;   // User input mode flag 
    uint8_t connected         : 1;   // Radio connected flag 
}
sik_system_data_t; 

static sik_system_data_t system_data; 


const char 
sik_test_user_prompt[] = "\r\n>>> ", 
sik_test_user_msgid[] = "msgid: %lu\r\n", 
sik_test_user_exitui[] = "exitui", 
sik_test_at_request[] = "Requesting AT command mode... ", 
sik_test_at_confirm[] = "OK\r\n", 
sik_test_timeout_msg[] = "timeout\r\n", 
sik_test_overwrite[] = "\r"; 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief AT command mode radio input decode 
 * 
 * @details 
 */
void sik_radio_test_at_radio_decode(void); 


/**
 * @brief MAVLink mode radio input decode 
 * 
 * @details 
 */
void sik_radio_test_mavlink_radio_decode(void); 


/**
 * @brief MAVLink message payload decode 
 * 
 * @details This function provides a means to decode any desired messages. Messages can 
 *          be added and removed as needed. A piece of code like this is needed for any 
 *          MAVLink application to define which messages to handle. 
 */
void sik_radio_test_mavlink_payload_decode(void); 


/**
 * @brief AT command mode user input decode 
 * 
 * @details 
 */
void sik_radio_test_at_user_decode(void); 


/**
 * @brief MAVLink mode user input decode 
 * 
 * @details 
 */
void sik_radio_test_mavlink_user_decode(void); 


/**
 * @brief MAVlink mode periodic actions 
 * 
 * @details 
 */
void sik_radio_test_mavlink_periodic(void); 


/**
 * @brief User prompt 
 * 
 * @param user_msg : message to send to the user 
 */
void sik_radio_test_user_output(const char *user_msg); 


/**
 * @brief AT command mode request reset 
 * 
 * @param user_msg 
 */
void sik_radio_test_at_request_reset(const char *user_msg); 

//=======================================================================================


//=======================================================================================
// Setup code 

