samdonnelly/STM32F4-driver-test/sources/device_test/sik_radio_test.cpp
    // New serial terminal (user input) data received 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR_BIT; 

        // Parse the new user message from the circular buffer into the data buffer 
        dma_cb_index(user_data.dma_stream, &user_data.dma_index, &user_data.cb_index); 
        cb_parse(user_data.cb, &user_data.cb_index, user_data.data_in_buff); 

        // Choose an action based on whether the radio is in AT command mode or not. 
        if (system_data.at_mode)
        {
            sik_radio_test_at_user_decode(); 
        }
        else 
        {
            sik_radio_test_mavlink_user_decode(); 
        }
    }
    
    // Periodic interrupt 
    if (handler_flags.tim1_brk_tim9_glbl_flag)
    {
        handler_flags.tim1_brk_tim9_glbl_flag = CLEAR_BIT; 

        // Only perform MAVLink actions when the SiK radio is not in AT command mode. 
        if (!system_data.at_mode)
        {
            sik_radio_test_mavlink_periodic(); 
        }
    }
}

//=======================================================================================


//=======================================================================================
// State functions 

// AT command mode radio input decode 
void sik_radio_test_at_radio_decode(void)
{
    // Echo the AT response from the radio to the serial terminal for the user to see. A 
    // prompt will be output after the user enters anything so it needs to be overwritten 
    // to make way for the radio response. 
    sik_radio_test_user_output(sik_test_overwrite); 
    sik_radio_test_user_output((char *)radio_data.data_in_buff); 
    sik_radio_test_user_output(sik_test_user_prompt); 
}


// MAVLink mode radio input decode 
void sik_radio_test_mavlink_radio_decode(void)
{
    // Besides a MAVLink message, the only other data received from the radio in MAVLink 
    // mode is an AT command mode enter response (assuming the user doesn't configure the 
    // radio to not use MAVLink). This is only checked for right after the user requests 
    // to go to AT command mode. 
    if (system_data.at_mode_requested)
    {
        if (str_compare(sik_at_enter_resp, (char *)user_data.data_in_buff, BYTE_0))
        {
            system_data.at_mode = SET_BIT; 
            sik_radio_test_at_request_reset(sik_test_at_confirm); 
        }
    }

    // Look at each byte of the received data and try to decode MAVLink messages 
    // until there is no more data to check. 
    while (radio_data.data_in_buff[radio_data.data_in_index] != NULL_CHAR)
    {
        if (mavlink_parse_char(
                system_data.channel, 
                radio_data.data_in_buff[radio_data.data_in_index++], 
                &system_data.msg, 
                &system_data.status))
        {
            // MAVLink message has been successfully decoded. Proceed to decode the 
            // message payload. Note that this can happen more than once if multiple 
            // messages are received or not at all if a valid message can't be decoded. 

            if (!system_data.ui_mode)
            {
                // If not in user input mode then display the message ID for the user to 
                // see. This is done here so all received messages are shown to the user 
                // even if the message payload is not meant to be decoded. 
                snprintf((char *)user_data.data_out_buff, 
                         SIK_TEST_MSG_BUFF_SIZE, 
                         sik_test_user_msgid, 
                         (uint32_t)system_data.msg.msgid); 
                sik_radio_test_user_output((char *)user_data.data_out_buff); 
            }

            sik_radio_test_mavlink_payload_decode(); 
        }
    }
}


// MAVLink message payload decode 
void sik_radio_test_mavlink_payload_decode(void)
{
    switch (system_data.msg.msgid)
    {
        case MAVLINK_MSG_ID_HEARTBEAT: 
            mavlink_msg_heartbeat_decode(
                &system_data.msg, 
                &system_data.heartbeat); 
            system_data.heartbeat_timer = CLEAR; 
            system_data.connected = SET_BIT; 
            break; 

        case MAVLINK_MSG_ID_GLOBAL_POSITION_INT: 
            break; 

        case MAVLINK_MSG_ID_GPS_STATUS: 
            break; 
        
        case MAVLINK_MSG_ID_COMMAND_INT: 
            // Call a separate function to decode mavlink_command_int_t.command 
            break; 
        
        case MAVLINK_MSG_ID_COMMAND_LONG: 
            // Call a separate function to decode mavlink_command_long_t.command 
            break; 
        
        default: 
            break; 
    }
}


// AT command mode user input decode 
void sik_radio_test_at_user_decode(void)
{
    // Take the user input while in AT command mode and try to match it to one of the 
    // predefined commands available in this test. If no command is matched then the 
    // input is sent as is to the radio and a new prompt will be displayed. Any response 
    // from the radio will be echoed to the serial terminal for the user to see. 
    if (str_compare(sik_ato_cmd, (char *)user_data.data_in_buff, BYTE_0))
    {
        // Exit AT command mode 
        sik_at_mode(SIK_AT_EXIT); 
        system_data.at_mode = CLEAR_BIT; 
    }
    else 
    {
        // Send input as is to the radio 
        sik_send_data((char *)user_data.data_in_buff); 
    }

    sik_radio_test_user_output(sik_test_user_prompt); 
}


// MAVLink mode user input decode 
void sik_radio_test_mavlink_user_decode(void)
{
    // When AT command mode has been requested by the user then block and other inputs 
    // from being registered until either AT command mode has been entered or the 
    // request has timed out (either way the AT command request flag is cleared). 
    if (system_data.at_mode_requested)
    {
        return; 
    }

    // When not waiting on AT command mode response and in MAVLink mode then look to 
    // match the user input to a predefined response. If no match is found then a 
    // new prompt will be displayed without any action or acknowledgement. 
    if (!system_data.ui_mode)
    {
        // If this is true then it means the code is in MAVLink mode (i.e. not AT 
        // command mode), all incoming messages are being displayed for the user to see 
        // and the user has provided any input via the serial terminal. This case will 
        // make it so messages will stop being displayed giving the user an opportunity 
        // to provide uninterrupted input (i.e. user input mode). 
        system_data.ui_mode = SET_BIT; 
        sik_radio_test_user_output(sik_test_user_prompt); 
    }
    else if (str_compare(sik_test_user_exitui, (char *)user_data.data_in_buff, BYTE_0))
    {
        // Exit user input mode 
        system_data.ui_mode = CLEAR_BIT; 
    }
    else if (str_compare(sik_at_enter_cmd, (char *)user_data.data_in_buff, BYTE_0))
    {
        // Submit an AT command mode request 
        sik_at_mode(SIK_AT_ENTER); 
        system_data.at_mode_requested = SET_BIT; 
        sik_radio_test_user_output(sik_test_at_request); 
    }
    else 
    {
        // No matching action found. Do nothing. 
        sik_radio_test_user_output(sik_test_user_prompt); 
    }
}


// MAVlink mode periodic actions 
void sik_radio_test_mavlink_periodic(void)
{
    // Everything here is performed periodically when in MAVLink mode. 

    // Send heartbeat for GCS to see 
    mavlink_msg_heartbeat_encode(
        system_data.system_id, 
        system_data.component_id, 
        &system_data.msg, 
        &system_data.heartbeat); 
    mavlink_msg_to_send_buffer(radio_data.data_out_buff, &system_data.msg); 
    sik_send_data((char *)radio_data.data_out_buff); 

    // Check for a connection (heartbeat) timeout 
    if (system_data.heartbeat_timer++ >= SIK_TEST_HB_TIMEOUT)
    {
        // Have not seen a heartbeat message from a GCS for too long. The system is 
        // considered to be disconnected. 
        system_data.heartbeat_timer--; 
        system_data.connected = CLEAR_BIT; 
    }

    // Check for an AT command mode request timeout 
    if (system_data.at_mode_requested)
    {
        // If AT command mode is being requested then the code waits on the appropriate 
        // response from the radio. Waiting for this response blocks other actions so 
        // once the system has waited too long then cancel the search and return to 
        // normal MAVLink mode. 
        if (system_data.at_mode_timer++ >= SIK_TEST_AT_TIMEOUT)
        {
            sik_radio_test_at_request_reset(sik_test_timeout_msg); 
        }
    }
}

//=======================================================================================


//=======================================================================================
// Helper functions 

// User prompt 
void sik_radio_test_user_output(const char *user_msg)
{
    uart_send_str(user_data.uart, user_msg); 
}


// AT command mode request reset 
void sik_radio_test_at_request_reset(const char *user_msg)
{
    system_data.at_mode_timer = CLEAR; 
    system_data.at_mode_requested = CLEAR_BIT; 
    sik_radio_test_user_output(user_msg); 
    sik_radio_test_user_output(sik_test_user_prompt); 
}

//=======================================================================================
